{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}]}}}, "outputs": {"activation": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "400"}]}}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/dense/BiasAdd", "op": "_FusedMatMul", "input": ["input_2", "StatefulPartitionedCall/model_2/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_2/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/reshape/Shape", "StatefulPartitionedCall/model_2/reshape/strided_slice/stack", "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_1", "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/reshape/strided_slice", "StatefulPartitionedCall/model_2/reshape/Reshape/shape/1", "StatefulPartitionedCall/model_2/reshape/Reshape/shape/2", "StatefulPartitionedCall/model_2/reshape/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_2/dense/BiasAdd", "StatefulPartitionedCall/model_2/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose/Shape", "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice", "StatefulPartitionedCall/model_2/conv2d_transpose/stack/1", "StatefulPartitionedCall/model_2/conv2d_transpose/stack/2", "StatefulPartitionedCall/model_2/conv2d_transpose/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose/stack", "StatefulPartitionedCall/model_2/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/reshape/Reshape"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/model_2/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_4/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_1/Shape", "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_1/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/leaky_re_lu_4/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/model_2/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_1/BiasAdd", "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_5/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_2/Shape", "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_2/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/leaky_re_lu_5/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/model_2/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_2/BiasAdd", "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_6/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_3/Shape", "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_3/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/leaky_re_lu_6/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/model_2/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/activation/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_2/activation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/dense/MatMul/ReadVariableOp", "shape": [400, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/dense/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_3/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}]}]}